In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [2]:
dframe=DataFrame(np.arange(8).reshape(2,4),
                index=pd.Index(["LA","SA"],name="Cities"),
                columns=pd.Index(list("ABCD"),name="Letters")
                )

In [3]:
dframe

Letters  A  B  C  D
Cities
LA       0  1  2  3
SA       4  5  6  7

In [4]:
type(dframe.stack())

pandas.core.series.Series

In [5]:
dframe.stack().unstack("Cities")

Cities   LA  SA
Letters
A         0   4
B         1   5
C         2   6
D         3   7

In [12]:
# Let's see how stack and unstack handle NAN

#Make two series
ser1 = Series([0, 1, 2], index=['Q', 'X', 'Y'])
ser2 = Series([4, 5, 6], index=['X', 'Y', 'Z'])

#Concat to make a dframe
dframe = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])

# Unstack resulting DataFrame
dframe.unstack().stack(dropna=False).unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [27]:
 #Lets create some data to play with:

# Note: It is not necessary to understand how this dataset was made to understand this Lecture.

#import pandas testing utility
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [28]:
dframe

         date variable     value
0  2000-01-03        A -0.383272
1  2000-01-04        A -1.433368
2  2000-01-05        A -2.749910
3  2000-01-03        B  1.155525
4  2000-01-04        B  0.061661
5  2000-01-05        B  0.287020
6  2000-01-03        C  0.307612
7  2000-01-04        C -1.177871
8  2000-01-05        C  0.637413
9  2000-01-03        D -0.827420
10 2000-01-04        D -0.167898
11 2000-01-05        D  1.416716

In [31]:
dframe.pivot("variable","date","value")

date      2000-01-03  2000-01-04  2000-01-05
variable
A          -0.383272   -1.433368   -2.749910
B           1.155525    0.061661    0.287020
C           0.307612   -1.177871    0.637413
D          -0.827420   -0.167898    1.416716

In [41]:
duppd=DataFrame({"key1":["a"]*2 + ["b"]*3,"key2":[2,2,3,3,3]})

In [42]:
duppd

  key1  key2
0    a     2
1    a     2
2    b     3
3    b     3
4    b     3

In [43]:
duppd.duplicated()

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [48]:
duppd.drop_duplicates(["key1"],keep="last")

  key1  key2
1    a     2
4    b     3

In [9]:
dfaltitudes=DataFrame({"City":["Alma","Denver","Fox Head"],"Altitude":[1023,2044,2020]})

In [10]:
dfaltitudes.sort_values("Altitude")

   Altitude      City
0      1023      Alma
2      2020  Fox Head
1      2044    Denver

In [11]:
dfaltitudes["state"]=dfaltitudes["City"].map({"Alma":"Colorado","Denver":"Colorado","Fox Head":"Wyoming"})

In [12]:
dfaltitudes

   Altitude      City     state
0      1023      Alma  Colorado
1      2044    Denver  Colorado
2      2020  Fox Head   Wyoming